public/datos/Facturas.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
    xmlns:siiLR='https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd'
    xmlns:sii='https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd'>   
    <soapenv:Header />
    <soapenv:Body>
        <siiLR:SuministroLRFacturasEmitidas>
            <sii:Cabecera>
                <sii:IDVersionSii>1.1</sii:IDVersionSii>
                <sii:Titular>
                    <sii:NombreRazon>FRUTAS MARTINEZ</sii:NombreRazon>
                    <sii:NIF>B75564654</sii:NIF>
                </sii:Titular>
                <sii:TipoComunicacion>A0</sii:TipoComunicacion>   () Desconozco
            </sii:Cabecera>
            <siiLR:RegistroLRFacturasEmitidas> ------() Empieza
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2023</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>871</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F2</sii:TipoFactura>  () Desconozco
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia> () Desconozco
                    <sii:ImporteTotal>40.12</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion> 
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta> ()Desconozco
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>38.58</sii:BaseImponible>
                                            <sii:CuotaRepercutida>1.54</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2020</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>872</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>75.87</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion>
                    <sii:Contraparte>
                        <sii:NombreRazon>MARTINEZ LÓPEZ RUBÉN</sii:NombreRazon>
                        <sii:NIF>27454778T</sii:NIF>
                    </sii:Contraparte>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>72.61</sii:BaseImponible>
                                            <sii:CuotaRepercutida>2.90</sii:CuotaRepercutida>
                                            <sii:TipoRecargoEquivalencia>0.50</sii:TipoRecargoEquivalencia>
                                            <sii:CuotaRecargoEquivalencia>0.36</sii:CuotaRecargoEquivalencia>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2020</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>873</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F2</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>4.38</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>4.21</sii:BaseImponible>
                                            <sii:CuotaRepercutida>0.17</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2020</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>874</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F2</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>8.78</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>8.44</sii:BaseImponible>
                                            <sii:CuotaRepercutida>0.34</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2020</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>858</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>94.02</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion>
                    <sii:Contraparte>
                        <sii:NombreRazon>FRUTERIA DE CALIDAD , S.L</sii:NombreRazon>
                        <sii:NIF>B30254787</sii:NIF>
                    </sii:Contraparte>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>90.40</sii:BaseImponible>
                                            <sii:CuotaRepercutida>3.62</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoLiquidacion>
                    <sii:Ejercicio>2020</sii:Ejercicio>
                    <sii:Periodo>02</sii:Periodo>
                </sii:PeriodoLiquidacion>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>B75564654</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>859</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>13-02-2020</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>38.75</sii:ImporteTotal>
                    <sii:DescripcionOperacion>Venta  de frutas y verduras</sii:DescripcionOperacion>
                    <sii:Contraparte>
                        <sii:NombreRazon>FRUTAS FRESCAS JUAN</sii:NombreRazon>
                        <sii:NIF>F854124645</sii:NIF>
                    </sii:Contraparte>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>4.00</sii:TipoImpositivo>
                                            <sii:BaseImponible>37.26</sii:BaseImponible>
                                            <sii:CuotaRepercutida>1.49</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>

        </siiLR:SuministroLRFacturasEmitidas>
    </soapenv:Body>
</soapenv:Envelope>